 [
  {
    "name": "Baccala alla Pizzaiola",
    "id": "baccala-pizzaiola",
    "img": "baccala-pizzaiola.jpg",
    "alt": "baccala pizzaiola",
    "ingredients": [
      "2 lb baccala ( salt cod )",
      "6 Tbsps olive oil",
      "2 large garlic cloves,very finely chopped",
      "3 cups peeled, seeded. and chopped fresh tomatoes or 28 to 35 oz can Italian peeled tomatoes, drained and chopped",
      "1 tsp dried oregano",
      "Salt and pepper to taste",
      "6 fresh basil leaves, torn into bits"
    ],
    "directions": [
      "Place the baccala in a large bowl with cool water to cover and place the bowl in the refrigerator to soak for 24 hours",
      "changing the water every few hours, until the water no longer tastes salty",
      "Bring about 2 inch of water to simmer in a deep skillet.",
      "Add the fish and cook for 10 minutes or until it is tender but not breaking apart.",
      "Remove the fish with a slotted spoon.",
      "Let cool, then remove any skin and bones.",
      "Meanwhile, put 1/4 cup of in the oil in a medium saucepan with the garlic and cook over medium heat until the garlic is lightly golden.",
      "Add the tomatoes and their juice, the oregano, and salt and pepper to taste.",
      "Bring to simmer and cook for 20 minutes or until the sauce is slightly thickened.",
      "Stir in the basil.",
      "Preheat the oven to 400 F.",
      "Choose a baking dish large enough to hold the fish in a single layer.",
      "Spoon a thin layer of sauce into the dish.",
      "Arrange the fish on top.",
      "Spoon on the remaining sausage and drizzle with the remaining 2 tablespoons oil.",
      "Bake for 30 minutes, or until the sauce is bubbling. Serve hot."
    ],
    "description":"",
    "category": ["seafood"]
  },
  {
    "name": "Basic Tomato Sauce/ Sugo di Pomodoro alla Napoletana",
    "id": "basic-sauce",
    "img": "basic_tomato_sauce.jpg",
    "alt": "basic tomato sauce",
    "ingredients": [
      "4 Tbsps olive oil",
      "1 medium onion, very finely chopped",
      "1 clove garlic, finely chopped",
      "1 lb tomatoes, fresh or canned, chopped with their juice",
      "salt and pepper to taste",
      "few leaves of fresh basil"
    ],
    "directions": [
      "Heat the oil in a medium pan.",
      "Add the chopped onion, and cook over a moderate heat until translucent-5 to 10 minutes..",
      "Stir in the garlic and the tomatoes with their juice",
      "(add 3 Tbsps of water if you are using fresh tomatoes).",
      "Season with salt and pepper. Add the herbs.",
      "Cook for 20 to 30 minutes.",
      "Pass the sauce through a food mill or puree’ in a food processor.",
      "To serve reheat gently, correct the seasoning and pour over the drained pasta."
    ],
    "description":"",
    "category": ["sauce"]
  },
  {
    "name": "Bistecca alla pizzaiola",
    "id": "bistecca-pizzaiola",
    "img": "bisteccapizzaiola.jpg",
    "alt": "bisteca alla pizzaiola",
    "ingredients": [
      "2 Tbsp olive oil",
      "4 small tender steaks",
      "2 garlic cloves, finely shopped or sliced",
      "Salt and pepper to taste",
      "1 28 oz can Italian peeled tomatoes, drained and chopped",
      "1 tsp dried oregano",
      "Pinch red pepper"
    ],
    "directions": [
      "In a large skillet, heat the oil over medium heat",
			"Pat the steaks dry. Add to the pan and cook, turning once,until browned on both sides.",
			"Sprinkle with salt and pepper.",
		  "Transfer the meat to a platter.",
			"scatter the garlic into the pan and cook for 1 minute.",
			"Add the tomatoes, oregano, red pepper, and salt to taste.",
			"Bring the sauce to  simmer. Cook for 20 minutes, or until the sauce is thickened.",
			"Return the steaks to the sauce. Cook briefly, turning the steaks once or twice, until they are warm and cooked to taste. Serve hot."
    ],
    "description":"",
    "category": ["beef"]
  },
  {
    "name": "Braciole",
    "id": "braciole",
    "img": "braciole.jpg",
    "alt": "braciole",
    "ingredients": [
      "4 thin slices boneless beef round (about 1 lb",
      "1 garlic clove, finely chopped",
      "2 Tbsps freshly grated Pecorino Romano",
      "2 Tbsps chopped fresh flat leaf parsley",
      "Salt and pepper to taste",
      "4 thin slice prosciutto",
      "3 Tbsps olive oil",
      "2 garlic cloves, lightly crushed",
      "1 cup dry red wine",
      "4 cups tomato puree, or canned Italian tomatoes passed through food mill",
      "4 fresh basil leaves,torn into small pieces",
      "1 lb ziti or penne, cooked and still hot"
    ],
    "directions": [
      "Place the beef between two pieces of plastic wrap and pound gently with a meat pounder or rubber mallet to 1/4 to 1/8 inch thickness.",
      "Sprinkle  the beef with the garlic, cheese, parsley, and salt and pepper.",
      "Cover with the prosciutto slices.",
      "Roll up each pieces like a sausage and tie it with kitchen string.",
      "Heat the oil in a large pot.",
      "Add the braciole and garlic.",
      "Cook, turning the meat occasionally, until it is browned on all the sides and the garlic golden.",
      "Add the wine and simmer for 2 minutes.",
      "Remove and discard the garlic.",
      "Stir in the tomatoes puree and basil.",
      "Cover and cook over low heat,turning the meat occasionally, until it is tender when pierced with a fork, about 2 hours.",
      "Add a little water if the sauce becomes too thick.",
      "Serve the sauce over the hot cooked ziti as a first course, followed by the braciole."
    ],
    "description":"",
    "category": ["beef"]
  },
  {
    "name": "Bruschetta",
    "id": "bruschetta",
    "img": "bruschetta.jpg",
    "alt": "bruschetta",
    "ingredients": [
      "4 large slices of bread, such as ciabatta, baguettes",
      "1 garlic clove",
      "drizzle of extra virgin olive oil"
    ],
    "directions": [
      "Grill, broil chargrill or toast the bread until it is crisp.",
      "Cut the garlic clove in half and rub the cut edge over both sides of each bread slice.",
      "Drizzle a little olive oil over each brad slice."
    ],
    "description":"",
    "category": ["antipasti"]
  },
  {
    "name": "Cannoli",
    "id": "cannoli",
    "img": "cannoli.jpg",
    "alt": "cannoli",
    "ingredients": [
      "For the Ricotta Cream",
      "2 lb. whole or part skim milk ricotta",
      "1 1/2 cup confectioners sugar",
      "1 teaspoon vanilla extract",
      "1/2 teaspoon ground cinnamon ",
      "1 oz. semisweet chocolate, chopped",
      "2 tablespoon chopped candied orange peel",

      "For the shells",
      "2 cups all purpose flour, plus more as need",
      "1 tablespoon unsweetened cocoa powder",
      "1/2 teaspoon ground cinnamon",
      "1/2 teaspoon salt",
      "3 tablespoon vegetable oil",
      "About 1/2 cup dry white wine",
      "1 egg white, beaten",
      "Vegetable oil for frying",
      "Candied cherries or candied orange peel (optional)",
      "Confectioners sugar"
    ],
    "directions": [
      "Line a large strainer white cheesecloth.",
      "Place the strainer over a bowl. Scrape the ricotta into the strainer and cover with a piece of plastic wrap and a small plate.",
      "Weight the plate with a heavy can.",
      "Let the ricotta drain in the refrigerator for several hours, or overnight.",

      "To make the shells:",
      "In the large bowl of an electric mixer, combine the flour, sugar, cocoa, cinnamon,and salt.>/li>",
      "Stir in the oil and enough wine to make a soft dough. ",
      "Turn the dough out onto a lightly floured surface and knead it until smooth and well blended, about 2 minutes.",
      "Shape the dough into a ball.",
      "Cover with plastic wrap and let rest at room temperature for at least 20 minutes.",
      "Cut the dough into 4 pieces. Starting at the middle setting, run one of the pieces of dough through the roller of a pasta machine.",
      "Lightly dust the dough with flour as needed to keep the pieces from sticking.",
      "Continue to pass the dough through the machine until you reach the last or second to the last setting. ",
      "The dough strip should be about 4 inches wide and thin enough to see your hand through.(The dough can be rolled on a board with a rolling pin,",
      "be sure to roll it very thin.)",
      "Measure the length of your cannoli tubes and cut the strip of dough crosswise into pieces about 1 inch shorter.",
      "Continue rolling out the remaining dough. ",
      "If you do not have enough cannoli tubes for all of the dough, lay the pieces of dough on sheets of plastic wrap and keep them cover until you are ready to use.",
      "Oil the cannoli tubes. ",
      "Place a cannoli tube on one piece of dough at an angle, from corner to corner.",
      "Fold the two other corners of the dough around the tube, being careful not to stretch the dough or pull it tightly. ",
      "Dab a little egg white on the dough where the edges overlap, avoid getting egg white on the tube, or the cannoli will stick to it.",
      "Press the overlap to seal. ",
      "Repeat with the reaming dough. ",
      "Pour 2 inches of oil into a deep fryer or deep heavy saucepan.",
      "Heat to 375 f. on a deep-frying thermometer.",
      " Line a baking pan with paper towels.",
      "Carefully lower a few of cannoli tubes into the hot oil. Do not crowd the pan.",
      "Fry the shells until golden, about 2 minutes, turning them so that they brown evenly.",
      "With tongs, remove the cannoli tubes, holding them straight up so that oil flows back into the pan.",
      " Drain the tubes briefly on the paper towels. ",
      " While the are still hot, carefully slide the cannoli shells from the tubes.",
      " Grasp each tube with a pot holder and pull the cannoli shell off the tube with a pair of tongs, or with you hand protected by an oven mitt or towel.",
      "Cool the shells completely on the paper towels.",
      "Repeat with the remaining container I dough. ( If you are reusing the cannoli tubes, let them cool before wrapping them in the dough.)",
      "Set aside. ( The cannoli shell can be made up 2 days before serving. Store in sealed in a cool, dry place.)",

      "To make the ricotta cream:",
      "Put the ricotta in a food processor and bland it until creamy.",
      "Add the confectioners’ sugar, vanilla, and cinnamon and bled until smooth.",
      "Transfer to a bowl and stir in the chocolateand the candied fruit, if using. ( The filling can be made up 24 hours before serving. Store and refrigerate.)",
      "To assemble:",
      "and cream.",
      "If desired, decorate the ends with candied cherry or strips of orange peel.",
      "Place the cannoli on a serving platter and sprinkle with confectioners’ sugar.",
      "Serve within 1 hour."
    ],
    "description":"",
    "category": ["dessert"]
  },
  {
    "name": "Gelato Alla Panna",
    "id": "gelato-panna",
    "img": "gelato-alla-panna.jpg",
    "alt": "gelato alla panna",
    "ingredients": [
      "6 eggs",
      "2 cups whole milk",
      "2 cups heavy cream",
      "1 cup sugar",
      "1 tspn vanilla extract",
      "3 slices day old Italian bread",
      "1 Tbsp lemon juice"
    ],
    "directions": [
    	"Combine milk, cream, and sugar in top of a double boiler;",
		  "heat until small bubbles form around sides of the pan. ",
  		"Add small amount of cream mixture to eggs yolks,",
		  "then stir yolks into cream mixture in top of double boiler.",
		  "Cook over simmering water, stirring constantly,",
		  "until mixture thickens enough to lightly coat a metal spoon.",
		  "Add vanilla. Strain, cool thoroughly.",
		  "Pour into two deep metal freezer trays, cover wit foil. ",
		  "Freeze until firm but not hard.",
		  "Chill bowl and beater.",
		  "Beat with electric mixer on high speed until double in volume.",
		  "Return to tray, freeze until firm but not hard.",
		  "Break up, beat again.",
		  "Freeze again until firm but not hard.",
		  "Repeat, freeze until firm for 2 hours."
    ],
    "description":"",
    "category": ["dessert"]
  },
  {
    "name": "Grilled Eggplant,Tomatoes,Provolone and Pesto Sandwiches",
    "id": "grilled-eggplant",
    "img": "eggplant-sandwich.jpg",
    "alt": "eggplant sandwich",
    "ingredients": [
      "4 Large slices eggplant",
      "Salt and Pepper to taste",
      "Extra  virgin olive oil",
      "2 slices baguette, 8 inches long,cut in half lengtwise",
      "1/4 cup pesto",
      "4 slices tomato, cut 1/2 inch thick",
      "4 slices Provolone cheese ( 3 oz.)",
      "2 small handful fresh arugula"
    ],
    "directions": [
      "To grill or roast eggplant, slice into 1/2 inch pieces, salt lightly and let stand for 10 minutes.",
      "Brush with olive oil and grill or broil until brown and softened.",
      "Spread pesto evenly on both sides of the baguette.",
      "Cover one side with tomato slices and Provolone.",
      "Cover the other side with eggplant and top with arugula.",
      "Close up the sandwiches, slice in half.",
      "Serve with a glass of red Italian wine."
    ],
    "description":"",
    "category": ["sandwich"]
  },
  {
    "name": "Insalata di Mare/Seafood Salad",
    "id": "insalata-di-mare",
    "img": "insalata-mare.jpg",
    "alt": "insalata di mare",
    "ingredients": [
      "2 lbs  mussels",
      "Salt to taste",
      "1 lb. medium shrimp,shelled and deveined",
      "1 lb. cleaned calamari(squid), cut crosswise onto 1/2 inch rings",
      "1 cup sliced pitted green olives",
      "1 cup thinly sliced celery",
      "1/3 cup extra virgin olive oil",
      "1/2 grated lemon zest",
      "2 garlic cloves, minced",
      "2 Tbsp fresh lemon juice, to taste",
      "2 Tbsp chopped fresh flat leaf parsley",
      "pinch of crushed red pepper",
      "1 lemon, cut into wedges"
    ],
    "directions": [
      "Place the mussels in cold water to cover for 30 minutes.",
      "Scrub the mussels with a stiff brush and scrape off any barnacles or seaweed, discarding any mussels with creaked shells or do not shut tightly when tapped.",
      "Remove the beard by pulling them toward the narrow end of the shells.",
      "Place the mussels in a large pot with 1/2 cup of water.",
      "Cover and cook until the mussels ope, 5 to 10 minutes. Discard any that not open.",
      "Bring a large saucepan of water to simmer.",
      "Add salt to taste and the shrimp. cook for 2 to 3 minutes, until the shrimp are just cooked through.",
      "Scoop out the shrimp and cool them under cold running water, drain well. ",
      "Leave the water boiling in the pot.",
      "Drop the calamari into the boiling water and cook just until opaque, about 1 minute.",
      "Drain thoroughly and cool under cold running water.",
      "Cut the shrimp into bite size pieces.",
      "Combine the shrimp, calamari, mussels, celery and olive in a large bowl.",
      "Whisk together the oil, lemon zest, lemon juice, parsley, garlic,salt to taste, and the crushed red pepper.",
      "Pour the dressing over the salad mixture and toss well.",
      "Season to taste.",
      "Garnish with the lemon wedges."
    ],
    "description":"",
    "category": ["seafood", "salad"]
  },
  {
    "name": "Marinara Sauce",
    "id": "marinara-sauce",
    "img": "marinara-sauce.jpg",
    "alt": "marinara sauce",
    "ingredients": [
      "2 large garlic cloves, lightly smashed",
      "1/4  cup olive oil",
      "2 lb very ripe plum tomatoes, peeled,seeded, and chopped, or 2(two) 28 oz cans Italian peeled tomatoes, drained and chopped",
      "salt to taste",
      "8 to 10 fresh basil leaves, torn into pieces"
    ],
    "directions": [
      "In a large skillet, cook the garlic in the olive oil over medium heat, pressing it occasionally with the back of a spoon, until golden, about 4 minutes.",
      "Add the tomatoes and salt to taste.",
      "Bring to simmer and cook, stirring often, until the sauce is thick, 15 to 20 minutes, depending on the tomatoes.",
      "Stir in the basil leaves.",
      "Serve over hot cooked spaghetti or other pasta"
    ],
    "description":"",
    "category": ["sauce"]
  },
  {
    "name": "Meatballs/Polpette",
    "id": "meatballs",
    "img": "meatballs.jpg",
    "alt": "meatballs",
    "ingredients": [
      "2 lbs ground beef",
      "2 eggs",
      "3 Tbs chopped fresh parsley",
      "Salt and pepper to taste",
      "4 Tbsp grated Parmigiano cheese",
      "3 slices day old Italian bread",
      "1 Tbsp lemon juice"
    ],
    "directions": [
      "Put the ground beef in a large bowl",
      "Add eggs, parsley, salt and pepper, cheese and lemon juice",
      "Wet the bread, squeeze out the water and shred it into the meat mixture.",
      "(If the crusts are to crusty and don’t shred easily, discard them)",
      "Mix everything well but not too harshly. From the mixture in ball about the size of a large egg.",
      "Put the meat balls in a cooking sheet and place in the oven, cook them until they are nicely browned and crisp on both sides. ",
      "Remove them and drain on a paper towel",
      "You can serve with wedges of lemon or simmer in a tomato sauce for about 15 to 20 minutes more."
    ],
    "description":"",
    "category": ["beef"]
  },
  {
    "name": "Minestrone",
    "id": "minestrone",
    "img": "minestrone.jpg",
    "alt": "minestrone",
    "ingredients": [
      "1 Tbsp olive oil",
      "2 onions,chopped",
      "2 garlic,crushed",
      "1 potato,peeled and cut into 1/2 inch cubes",
      "1 carrot, peeled and cut into chunks",
      "1 leek, sliced into rings",
      "1/4 green cabbage, shredded",
      "1 celery stalk,chopped",
      "1 can small navy beans,drained and rinsed",
      "2 1/2 cups chicken stock, diluted with 2 1/2 cups hot water",
      "bouquet garni , 2 bay leaves, 2 springs rosemary, and 2 springs thyme",
      "salt and pepper to taste",
      "freshly grated Parmigiano cheese, to serve"
    ],
    "directions": [
      "Heat the olive oil in a large saucepan.",
      "Add the chopped onions, and garlic and fry about 5 minutes, stirring, or until the onions are soft and golden.",
      "Add the prepared potato, carrot, leek, cabbage, and celery to the saucepan.",
      "Cook for a further 2 minutes, stirring frequently, to coat all the vegetable in the oil.",
      "Add the tomatoes, small navy beans, chicken stock, and bouquet garni to the pan, stirring to mix.",
      "Leave the soup to simmer, covered, for 15 to 20 minutes, or until all of the vegetables are just tender.",
      "Remove the bouquet garmi, season with salt and pepper to taste, and serve with plenty of freshly frated Parmigiano cheese."
    ],
    "description":"",
    "category": ["soup"]
  },
  {
    "name": "Osso Buco",
    "id": "osso-buco",
    "img": "osso-buco.jpg",
    "alt": "osso buco",
    "ingredients": [
      "1/4 cup all purpose flour",
      "4 meaty slices veal shank, about  1 1/2 inch thik",
      "2 Tbsps unsalted butter",
      "1 Tbsp olive oil",
      "Salt ant pepper to taste",
      "1 small onion, finely chopped",
      "1/2 cup dry white wine",
      "1 cup peeled, seeded, and chopped fresh tomatoes or chopped canned Italian peeled tomatoes",
      "1 cup chicken broth or meat broth",
      "2 garlic cloves, finely chopped",
      "2 Tbsp minced fresh flat leaf parsley",
      "2 carrots, diced in cubes",
      "1 Tbsp tomato paste",
      "2  stacks of celery, diced in cubes",
      "1 tsp grated lemon zest"
    ],
    "directions": [
      "Cook spaghetti in a large pan of rapidly boiling water",
      "I a large frying pan heat the oil and garlic gently saute’ the garlic until it is barely golden.",
      "Do not let it brown or it will taste bitter.",
      "Stir in the parsley.",
      "Season with salt and pepper.",
      "Remove from the heat until the pasta is ready.",
      "Drain the pasta when it is barely al dente.",
      "Add it to to the pan with the oil and garlic, and cook together for 2 to 3 minutes, stirring well to coat the spaghetti with the sauce.",
      "Serve immediately in warmed serving bowl, with Parmigiano and red pepper, if desired."
    ],
    "description":"",
    "category": ["beef"]
  },
  {
    "name": "Panzanella Insalata",
    "id": "panzanella-insalata",
    "img": "panzanella.jpg",
    "alt": "panzanella",
    "ingredients": [
      "3 1/2 cups stale bread white or brow or rolls",
      "1 clove garlic, peeled and mince",
      "4 large tomatoes",
      "1 large red onions, or 6 spring onions",
      "3 – 4 leaves fresh basil- to garnish",
      "For Dressing:",
      "4 Tbsps extra virgin olive oil",
      "2 Tbsps white wine vinegar",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Cut the bread or rolls into thick slices.",
      "Place in a shallow bowl, and soak with cold water.",
      "Leave for at least 30 minutes",
      "Cut the tomatoes into chunks. Place in a serving bowl.",
      "Finely slice the onion or spring onion, and add them to the tomatoes.",
      "Squeeze as much water out the bread as possible, and add it to the vegetables",
      "Make a dressing with the oil and vinegar.",
      "Season with salt and pepper.",
      "Pour it over the salad and mix well.",
      "decorate with the basil leaves, Allow to stand in a cool place for at least 2 hours before serving"
    ],
    "description":"",
    "category": ["salad"]
  },
  {
    "name": "Pasta e Fagioli",
    "id": "pasta-fagioli",
    "img": "pasta-e-fagioli.jpg",
    "alt": "pasta e fagioli",
    "ingredients": [
      "1 cup dried cannellini or Great Northern beans or 3 cups canned beans, rinsed and drained",
      "1 celery rib, chopped",
      "12 garlic cloves, lightly crushed",
      "1 cup peeled, seeded, and chopped fresh tomatoes or canned Italian peeled tomatoes",
      "1/4 cup olive oil",
      "1 tsp tomato paste",
      "1/2 cup water",
      "1 pinch of crushed red pepper",
      "Salt to taste",
      "8 oz ditalini or spaghetti or other pasta broken into 1 inch pieces."
    ],
    "directions": [
      "Note: If using dried beans, put them in a bowl with cold water to cover by 1 inch, and let stand for at least 4 hours, or overnight.",
      "Add more water if necessary to keep the beans covered.",
      "Drain the beans and place them in a pot with fresh water to cover by 1/2 inch.",
      "Bring to a simmer over low heat. Cover the pot and cook until the beans are soft, about 1 hour.",
      "Add more water if needed to keep the beans just covered.",
      "When the beans are almost ready, cook the celery and garlic in the olive oil in a large saucepan over moderate heat.",
      "When the garlic is golden, discard it.",
      "Add the tomatoes, tomato paste, water, pepperoncino, and salt to taste.",
      "Simmer for 10 minutes, or until the sauce is slightly thickened.",
      "Add the beans and their cooking liquid, or the canned beans to the sauce.",
      "Bring the mixture to simmer, mashing some of the beans with the back of a large spoon.",
      "Stir in the pasta and cook, stirring often, until the pasta is al dente, tender yet still firm to the bite.",
      "The mixture shold be very thick, but add boiling water if it seems too thick.",
      "Turn off the heat and let stand for 10 minutes before serving."
    ],
    "description":"",
    "category": ["soup"]
  },
  {
    "name": "Pasta di Mare",
    "id": "pasta-di-mare",
    "img": "pasta-mare.jpg",
    "alt": "pasta di mare",
    "ingredients": [
      "1 lb spaghetti # 4",
      "1 6 oz Tomato Paste",
      "1 28 oz Tomato Sanmarzano (Italian Peeled Tomatoes)",
      "4 Garlic Gloves",
      "½ small Onions",
      "1 Ts Basil (Dry)",
      "3 Bay Leaves",
      "Salt and Pepper to taste",
      "3 Cups of water",
      "½ ts Crushed red pepper (hot)",
      "1 ts Sugar",
      "2 Ts Extra Vergine Olive oil",
      ".50 lb Fresh Mussels",
      ".5o lb Baby Scallops",
      ".50 lb Shrimp (peeled)"
    ],
    "directions": [
      "In a saucepan, heat the olive oil and sauté the onions and garlic, stir until the ingredients are translucent.",
      "Add water, tomato paste, Sanmarzano tomatoes, sugar, salt, pepper, bay leaves and crushed pepper.",
      "Simmer for 20 minutes. Add basil, simmer for 30 minutes.",
      "In the mean time, cook the pasta al dente.",
      "After the sauce has cooked for 30 minutes add shrimp, scallops and mussels, cook for 10 to 15 minutes. ",
      "Pour sauce over the pasta and mix. "
    ],
    "description":"",
    "category": ["pasta", "seafood"]
  },
  {
    "name": "Pizza Dough",
    "id": "pizza-dough",
    "img": "pizza_dough.jpg",
    "alt": "pizza dough",
    "ingredients": [
      "5 cups unbleached flour",
      "2 packets active dry yeast",
      "2 cups warm water",
      "olive oil"
    ],
    "directions": [
      "Add just a bit of warm water to the yeast and start stirring it with a fork.",
      "As it gathers flour and a paste start to form, add more water.",
      "Keep on stirring and adding water to the paste until all the water is used.",
      "Start to work it with your hands.",
      "At first the dough seems hopeless and very raggedy.",
      "But in a about 2 minutes it take on the tough shape and consistency of play dough,",
      "and will continue to pick up the remaining flour as you knead back and forth.",
      "Add the salt. Keep on kneading until the dough is soft, smooth and warm.",
      "At the end of about 15 minutes you should have a very smooth ball, so light",
      "in texture you can see your hadprint briefly before the dough bounces back",
      "If, after all the original flour has been used, the dough begins to stick to the counter,",
      "sprinkle with some extra flour.",
      "Put a teaspoon or so of olive oil in a bowl at last twice as big as the finished ball of dough.",
      "Roll the dough around in the oil until it is well coated.",
      "Cover the bowl with plastic wrap, sealing it well.",
      "Put in a warm place and let it rise until  doubled in size.",
      "Preheat the oven to 450f.",
      "Punch the dough down, cut in fourths, and flatten each piece out on a floured surface,Roll the pieces.",
      "Bake at 450 f. the time depending on the type of pizza.",
      "Usually it take about 20 minutes total timing to get a well baked pizza,",
      "once that's toasty and crispy on the bottom and edges."
    ],
    "description":"",
    "category": ["pizza"]
  },
  {
    "name": "Polenta",
    "id": "polenta",
    "img": "polenta.jpg",
    "alt": "polenta",
    "ingredients": [
      "6 cups water",
      "1 tbsp salt",
      "2 1/2 polenta flour"
    ],
    "directions": [
      "Bring the water to boil in a large saucepan.",
      "Add the salt.",
      "Reduce the heat to simmer, and begin to add the polenta flour in a fine rain. ",
      "Stir constantly with a whisk until the polenta has all been incorporated.",
      "Switch to a long handled wooden spoon, and continue to stir the polenta over low to",
      "moderate heat until it is a thick mass, and pull away from the sides of the pan",
      "This may take from 25 to 30 minutes depending on the type of polenta used.",
      "For best results, never stop stirring the polenta until you remove it from the heat.",
      "When the polenta is cooked, spoon it in a large slightly wet bowl, wait 5 minutes, and turn it out onto a serving platter.",
      "Serve it with a meat or tomato sauce."
    ],
    "description":"",
    "category": ["pasta"]
  },
  {
    "name": "Polpetti in Salsa di Pomodoro",
    "id": "polpetti-salsa-pomodoro",
    "img": "polpetti.jpg",
    "alt": "polpetti",
    "ingredients": [
      "2 lb baby octopus",
      "2 cups peeled, seeded, and chopped fresh tomatoes or chopped canned Italian peeled tomatoes",
      "1/4 cup olive oil",
      "1/4 cup chopped fresh flat leaf parsley",
      "2 large garlic cloves, finely chopped",
      "Pinch of crushed red pepper",
      "Salt to taste",
      "6 to 12 slices toasted Italian bread"
    ],
    "directions": [
      "Rinse the octopus and drain well. ",
      "Remove the hard round beak at the base of the tentacles of each octopus.",
      "In a large heavy saucepan, combine the octopus,tomatoes,oil, 3 Tbsps of the parsley, garlic,red pepper, and salt to taste.",
      "Bring sauce to simmer.",
      "Cover the pot and cook over very low heat, stirring occasionally, for 45 minutes.",
      "Uncover the pan and cook for 15 minutes more, or until the octopus is tender when pierced with a knife and the sauce is thick. ",
      "Sprinkle the toast bread with water to soften slightly.",
      "Divide the toast bread, among six plates.",
      "Top with the octopus and sauce.",
      "Sprinkle with the renaming parsley and serve."
    ],
    "description":"",
    "category": ["seafood"]
  },
  {
    "name": "Potato Gnocchi",
    "id": "potato-gnocchi",
    "img": "potatognocchi.jpg",
    "alt": "potato gnocchi",
    "ingredients": [
      " 2 lb potatoes, scrubbed ",
      "salt and pepper to taste",
      "2 1/2 cups flour",
      "1 egg",
      "Freshly grated Parmigiano cheese, to serve"
    ],
    "directions": [
      "Place the unpeeled potatoes in a large pan of salted water.",
      "Bring to a boil, and cook until the potatoes are tender but not falling apart.",
      "Drain. Peel as soon as possible, while the potatoes are still hot.",
      "On a work surface spread out a layer of flour.",
      "Mash the hot potatoes with a food mill, dropping them directly onto the flour. ",
      "Sprinkle with about half of the reaming flour and mix lightly into the potatoes.",
      "Break the egg into the mixture, and knead lightly, drawing in more flour as needed.",
      "When the dough is light to touch and no longer moist or sticky it is ready to rolled.",
      "Do not overwork or the gnocchi will be heavy.",
      "Hold an ordinary table fork with long tines sideways, leaning on the board.",
      "One by one press and roll the gnocchi lightly along the tines of the fork towards the points, making ridges on one side, and a depression from your thumb on the other.",
      "Bring  a large pan of water to a fast boil. Add salt, and drop in about half the gnocchi.",
      "When the gnocchi rise to the surface, after 3 to 4 minutes, the are cooked. ",
      "Scoop them out of the water, allow to drain, and place in a warmed serving bowl.",
      "Dot with Sauce, sprinkle with grated Parmigiano and serve."
    ],
    "description":"",
    "category": ["pasta"]
  },
  {
    "name": "Ricotta Cheesecake",
    "id": "ricotta-cheesecake",
    "img": "ricottacheesecake.jpg",
    "alt": "ricotta cheesecake",
    "ingredients": [
      "2 cups low fat ricotta cheese",
      "1/2 cup double cream",
      "2 eggs",
      "1 egg yolk",
      "1/2 cup caster sugar",
      "finely grated ring of 1 orange",
      "finely grated ring of 1 lemon",
      "For the pastry",
      "1 1/2 cup plain flour",
      "3 Tbsps caster sugar",
      "pinch of salt",
      "8 Tbsps chilled butter, diced",
      "1 egg yolk"
    ],
    "directions": [
      "Make the pastry:",
      "Sift the flour, sugar and salt on to a work surface.",
      "Make a well in the center and put in the diced butter and eggs yolk.",
      "Gradually work the flour into the diced butter and eggs yolk, using your fingertips.",
      "Gather the dough together, reserve about a quarter for the lattice,",
      "then press the rest into a 9 inch tin with a removable base.",
      "Chill the pastry case for 30 minutes.",
      "Meanwhile, preheat the oven to 375f.and make the filling:",
      "Put all the ricotta, cream, eggs, egg yolk, sugar and orange",
      "and lemon rinds in a large bowl and beat together until evenly mixed.",
      "Prick the bottom of the pastry case, than line with foil and fill with baking beans.",
      "Bake blind for 15 minutes, then transfer to a wire rack, remove the foil",
      "add beans and allow the tart shell to cool the tin.",
      "Spoon the cheese and cream filling into the pastry case and level the surface.",
      "Roll out the reserved dough and cut into strips.",
      "Arrange the strips on the top of the filling in a lattice pattern, sticking them in place with water.",
      "Bake for 30/35 minutes until golden and set.",
      "Transfer to a wire rack and leave to cool, then carefully remove the side of the tin, leving the cheesecake on the tin base."
    ],
    "description":"",
    "category": ["dessert"]
  },
  {
    "name": "Roasted Pepper Salad",
    "id": "roasted-pepper-salad",
    "img": "peppersalad.jpg",
    "alt": "roasated red pepper salad",
    "ingredients": [
      "8 large red, yellow, and green bell peppers",
      "1/3 cup extra virgin olive oil",
      "6 fresh basil leaves, torn into pices",
      "2 garlic cloves, thinly sliced",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Cover the broiler par with foil.",
      "Place the peppers on the pan and place in the broiler so that the peppers are about 3 inches from the heat.",
      "Turn the broiler on high. Broil the peppers, turning them frequently, until the skin blisters and they are charred all over.",
      "Put the peppers in a bowl, cover with foil, and let cool. Cut the peppers in half, draining the juices into a bowl.",
      "Peel off the skin and discard the seed and stems. Cut the peppers lengthwise into 1 inch strips and place in a serving bowl.",
      "Strain the juices over the peppers. Add the olive oil, basil, garlic, and salt and pepper to taste.",
      "Let marinate for a least  30 minutes before serving."
    ],
    "description":"",
    "category": ["salad"]
  },
  {
    "name": "Roast Lamb with Rosemary / Agnello al Rosmarino",
    "id": "roast-lamb-rosemary",
    "img": "rosemary_agnello1.jpg",
    "alt": "roast lamb with rosemary",
    "ingredients": [
      "1/2 leg of lamb",
      "2 to 3 garlic cloves, cut lengthways into thin slivers",
      "4 springs of fresh rosemary, finely chopped",
      "7 Tbsps olive oil",
      "salt and pepper to taste",
      "2 fresh leaves of sage, chopped"
    ],
    "directions": [
      "Preheat the oven to 400°F",
      "Using the point of a sharp knife make deep incisions in the lamb,especially near the bone and insert the slivers of garlic.",
      "Put the lamb in a roasting pan rub it over with 3 Tbsps of olive oil",
      "Sprinkle the chopped rosemary and sage, patting it firmly, and season with salt and pepper.",
      "Roast for 30 minutes, turn over once.",
      "Lower the oven to 375f. Turn the lamb over again.",
      "Roast for a further 1 1/2 hours until the lamb is tender.",
      "Transfer the lamb to a carving board, tent with foil and leave in a warm place for 10 minutes so that the flesh firms for easier carving.",
      "Serve whole or carved into thin slices"
    ],
    "description":"",
    "category": ["beef"]
  },
  {
    "name": "Sauce/Sugo",
    "id": "sauce",
    "img": "sauce.jpg",
    "alt": "sauce",
    "ingredients": [
      "1 1/2 Tbsps olive oil",
      "1 onion,chopped very finely",
      "1 garlic clove, chopped very finely",
      "2 13 oz cans Italian tomatoes, chopped",
      "1/4 cup fresh basil leaves",
      "salt and pepper to taste"
    ],
    "directions": [
      "Heat the oil in a large frying pan.",
      "Add the onion and cook over medium heat until softened.",
      "Stir in chopped tomato and simmer for 5 to 7 minutes, or until the sauce has reduced slightly and thickened.",
      "Season with salt and freshly ground pepper. Stir in the basil leaves and cook for another minute.",
      "Pour the sauce over the warm pasta and gently toss through.",
      "Serve immediately.",
      "This is a sauce suitable for serving with freshly grate Parmigiano cheese."
    ],
    "description":"",
    "category": ["sauce"]
  },
  {
    "name": "Spaghetti con aglio e olio/ Garlic Spaghetti",
    "id": "spaghetti-aglio-oglio",
    "img": "spaghetti-aglio-oglio.jpg",
    "alt": "garlic spaghetti",
    "ingredients": [
        "14 oz spaghetti",
        "6 Tbsp extra virgin olive oil",
        "3 cloves garlic, chopped",
        "4 Tbsp chopped fresh parsley",
        "Salt and pepper to taste",
        "Fresh grated Parmigiano cheese, to serve",
        "red pepper flakes (optional)"
    ],
    "directions": [
      "Cook spaghetti in a large pan of rapidly boiling water",
      "I a large frying pan heat the oil and garlic gently saute’ the garlic until it is barely golden.",
      "Do not let it brown or it will taste bitter.",
      "Stir in the parsley.",
      "Season with salt and pepper.",
      "Remove from the heat until the pasta is ready.",
      "Drain the pasta when it is barely al dente.",
      "Add it to to the pan with the oil and garlic, and cook together for 2 to 3 minutes, stirring well to coat the spaghetti with the sauce.",
      "Serve immediately in warmed serving bowl, with Parmigiano and red pepper, if desired."
    ],
    "description":"This is one of the simplest and most satisfying pasta dishes of all. It is very popular throughout Italy. Use the best quality available for this dish.",
    "category": ["pasta"]
  },
  {
    "name": "Spaghetti alle Vongole",
    "id": "spaghetti-vongole",
    "img": "spaghetti-vongole.jpg",
    "alt": "spaghetti alle vongole",
    "ingredients": [
      "2 Tbsp  Olive Oil",
      "3 Cloves garlic, crushed",
      "Pinches of peperoncino flakes",
      "1 tsp parsley, chopped",
      "1/2 Cup dry white wine",
      "2 14 oz tomatoes, tin chopped",
      "2 1/2 lb clams (vongole)",
      "2 Tbsp finely chopped parsley",
      "14 oz Spaghetti or Linguine",
      "1/2 tsp grated lemon zest",
      "lemon wedges",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Heat the oil in a large deep frying pan.",
      "Add the garlic and chilli and cook over low heat for 30 seconds.",
      "Add the parsley, wine and tomatoes.",
      "Increase  the heat and boil, stirring occasionally, for 8 to 10 minutes until the liquid is reduced by half. ",
      "Clean the clams by scrubbing them thoroughly. ",
      "Discard any that are broken or cracked or do not close when tapped on the work surface.",
      "Add to the saucepan. ",
      "Cover the pan, increase the heat and cook for 3 to 5 minutes until the clams open. ",
      "Shake the pan often. ",
      "Remove the clams from the pan, discarding any that stay closed.",
      "Stir in the parsley and season. Uncover the pan and boil until thick. ",
      "Set 12 clams aside and extract the meat from the rest.",
      "Cook the pasta in a large saucepan of boiling salted water until al dente.",
      "Drain and stir through the sauce. Add the lemon zest, reserved clams and clams meat and toss well.",
      "Serve with the lemon wedges."
    ],
    "description": "",
    "category": ["pasta", "seafood"]
  },
  {
    "name": "Spaghetti with Tuna Sauce",
    "id": "spaghetti-tuna-sauce",
    "img": "spaghetti-tunasauce.jpg",
    "alt": "spaghetti with tuna sauce",
    "ingredients": [
      "8 oz spaghetti",
      "1 garlic clove,crushed",
      "14 oz can chopped tomatoes",
      "15 oz can tuna fish in brine, drained",
      "1 tsp chilli sauce",
      "4 black olives, stoned and chopped",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Cook the spaghetti in lightly salted boiling water for about 10 minutes or until al dente.",
      "Drain well and keep hot.",
      "Add the garlic and tomatoes to the pan and bring to the boil.",
      "Simmer uncovered for 2 to 3 minutes. ",
      "Add the tuna, chilli sauce,olives and spaghetti to the pan.",
      "Heat well, season to taste with salt and plenty of black pepper and serve hot."
    ],
    "description": "",
    "category": ["pasta", "seafood"]
  },
  {
    "name": "Spaghetti alla Puttanesca",
    "id": "spaghetti-puttanesa",
    "img": "spaghetti-alla-puttanesca.jpg",
    "alt": "spaghetti alla puttanesca",
    "ingredients": [
      "4 Tbsps olive oil",
      "2 cloves garlic,finely chopped",
      "12 oz tomatoes, fresh or canned, chopped",
      "pinch of crushed hot pepper",
      "2 oz anchovy fillets, chopped",
      "4 oz  pitted black olives",
      "2 Tbsps capers, rinsed",
      "1 Tbsp tomato paste",
      "14 oz spaghetti",
      "2 Tbsps chopped fresh parsley to serve",
      "salt and pepper to taste"
    ],
    "directions": [
      "Bring a large pan  of water to the boil.",
      "Heat the oil in a large pan.",
      "Add the garlic and the dried hot pepper, and cook for 2 to 3 minutes until the garlic is golden.",
      "Add the anchovys, and mash them into the garlic with a fork.",
      "Add the tomatoes, olives, capers and tomato paste.",
      "Stir well cook over moderate heat.",
      "Add salt to the boiling water, and put in the spaghetti.",
      "Stir, and cook until the pasta is  all dente, Drain.",
      "Turn the spaghetti into the sauce.",
      "Raise the heat, and cook for 1 to 2 minutes, turning the pasta constantly.",
      "Sprinkle with parsley if desired and serve.",
      "Traditionally no cheese is served with this sauce."
    ],
    "description": "",
    "category": ["pasta"]
  },
  {
    "name": "Fried Rice Balls/Suppli",
    "id": "suppli",
    "img": "suppli.jpg",
    "alt": "Suppli fried rice balls",
    "ingredients": [
      "1 recipe Risotto with Parmigiano cheese",
      "3 eggs",
      "2/3 cup mozzarella cheese, cut into small dices",
      "plain breadcrumbs",
      "as required oil, for deep frying",
      "flour, to coat"
    ],
    "directions": [
      "Allow the risotto to cool completely",
      "(better if the risotto made the day before ).",
      "Beat 2 eggs, and mix them well into the cold risotto.",
      "Use your hands to form the rice mixture into balls the size of a large egg.",
      "If the mixture is too moist to hold its shape well, stir in a few tablespoons of breadcrumbs as necessary.",
      "Poke a hole into the center of each ball, fill it with a few small cubes of mozzarella,and close the hole over again with the mixture.",
      "Heat the oil until a small piece of bread sizzles as soon as it is dropped in. 360 f. (185 c.) ",
      "Spread some flour on a plate.",
      "Beat the remaining egg in a shallow bowl.",
      "Sprinkle another plate with breadcrumbs. ",
      "Roll the balls in the flour then in the egg, and finally in the breadcrumbs.",
      "Fry them a few at a time in the hot oil until golden and crisp.",
      "Drain on paper towels while the remaining ball are frying.",
      "Serve hot "
    ],
    "description": "",
    "category": ["pasta", "anitpasti"]
  },
  {
    "name": "Tiramisu",
    "id": "tiramisu",
    "img": "tiramisu_1.jpg",
    "alt": "tiramisu",
    "ingredients": [
      "1 pound mascarpone",
      "¼ cup sugar",
      "2 tablespoon amaretto or Cognac",
      "1 cup heavy cream",
      "24 savoiardi (Italian ladyfingers)",
      "1 cup brewed espresso at room temperature",
      "½ cup chopped bittersweet chocolate"
    ],
    "directions": [
      "In a large bowl, whisk together the mascarpone, sugar and amaretto until smooth.",
      "In a chilled bowl with chilled beaters whip the cream until soft.",
      "Fold the cream into the mascarpone mixture.",
      "Lightly dip half of savoiardi in the espresso and arrange in a single layer in the bottom of an 8 inch square pan.",
      "Sprinkle with half the chocolate.",
      "Dip the remaining savoiardi in the espresso. ",
      "Top with the remaining mascarpone mixture, spreading it smooth.",
      "Sprinkle with the remaining chocolate.",
      "Cover with wrap.",
      "Refrigerate for several hours or overnight before serving."
    ],
    "description": "",
    "category": ["dessert"]
  },
  {
    "name": "Tomato and Basil Bruschetta",
    "id": "tomato-basil-bruschetta",
    "img": "tomatobruschetta.jpg",
    "alt": "tomato and basil bruschetta",
    "ingredients": [
      "4 ripe tomatoes",
      "1 Tbsp shredded basil",
      "salt and pepper to taste",
      "2 tsps extra virgin olive oil",
      "1 garlic clove, chopped",
      "4 pieces bread, ciabatta, baguette"
    ],
    "directions": [
      "Grill, broil or toast the bread until crisp.",
      "Roughly chop the tomatoes and mix with the basil, olive oil and garlic.",
      "Season well and pile onto toasted bread"
    ],
    "description": "",
    "category": ["antipasti"]
  },
  {
    "name": "Tortellini in Brodo",
    "id": "tortellini-brodo",
    "img": "tortellini-in-brodo.jpg",
    "alt": "tornellini in brodo",
    "ingredients": [
      "For Filling:",
      "2 Tbsp butter",
      "4 oz boneless pork loin, cut into 1 inch cubes",
      "4 oz prosciutto",
      "4 oz mortadella",
      "1 cup freshly grated Parmigiano Reggiano",
      "1 large egg",
      "1/4 tsp freshly ground nutmeg",

      "For the Pasta",
      "4 large eggs",
      "1 Tbsp olive oil",
      "About 3 cups all purpose flour",

      "To Serve",
      "8 cups beef broth, preferably homemade",
      "8 cups chicken broth, preferably homemade",
      "Fresh grated Parmigiano Reggiano"
    ],
    "directions": [
      "To make the filling:",
      "Melt the butter in a small skillet over medium heat.",
      "Add the pork and cook, steering  occasionally, until cooked through, about 20 minutes.",
      "In a food processor or meat grinder, grind the pork, prosciutto, and mortadella very fine.",
      "In a bowl, mix the ground meats with the egg, Parmigiano , and nutmeg. Cover and refrigerate until ready to use.",

      "To make the pasta:",
      "Put the eggs and oil in a food processor or a bowl of heavy duty mixer.",
      "Gradually add 2 1/2 cups of the flour and mix until the dough forms a ball.",
      "Stop the machine and fell the dough, it should be moist but not sticky. Add more flour if needed.",
      "Transfer the dough to a lightly floured surface.",
      "Knead the doh for about 1 minute, until it feels firm and smooth.",
      "Cover with a bowl and let rest for 30 minutes.",
      "Line 2 or 3 large baking sheets with lint free towels.",
      "Dust the towels with flour.",
      "Divide the dough into 8 pieces.",
      "Work with one piece at the time, keeping the remainder cover with the overturned bowl.",
      "With a rolling pin or pasta machine, roll out the dough as thin as possible.",
      "Cut the dough into 2 inches squares. Places about 1/2 tsp of the filling on each square.",
      "Working quickly so that the dough does not dry out, fold the dough over the filling to form a triangle, and press the edges together to seal.",
      "Fold the  two opposite points of the triangle together , to form a circle, and pinch the ends to seal.",
      "Place the formed tortellini on a prepared baking sheet and prepare the remaining dough and filling in the same way.",
      "Refrigerate the tortellini until ready to cook, up to several, or overnight.",
      "For longer storage, freeze them on the baking sheet for 1 hour or until firm, then transfer them to plastic bags and store in the freezer up to 1 month.",
      "Do not thaw before cooking.",

      "To serve:",
      "Combine the beef and chicken broth in a large pot.",
      "Bring to simmer.",
      "Add the tortellini and cook, 3 to 5 minutes or until the pasta is cooked through- stirring occasionally.",
      "Serve with Parmigiano Reggiano."
    ],
    "description": "",
    "category": ["soup"]
  },
  {
    "name": "Tuna and Bean Salad/ Tonno e Fagioli",
    "id": "tuna-bean-salad",
    "img": "tunaandbeansalad.jpg",
    "alt": "tuna and bean salad",
    "ingredients": [
      "2- 14 oz cans Cannellini or Bordoli beans",
      "2- 7 oz cans tuna fish, drained",
      "4- Tbsps extra virgin olive oil",
      "2- Tbsps fresh lemon juice",
      "Salt and pepper to taste",
      "1 Tbsp fresh chopped parsley",
      "3 spring onions, thinkly sliced"
    ],
    "directions": [
      "Pour the beans into a large strainer and rinse under cold water. Drain well.",
      "Place in a serving dish.",
      "Break the tuna into fairly large flakes and arrange over the beans.",
      "In a small bowl make the dressing by combining the oil with the lemon juice.",
      "Season with salt and pepper, and stir in the parsley.",
      "Mix well. Pour over the beans and tuna.",
      "Sprinkle with the spring onions.",
      "Toss well before serving."
    ],
    "description": "",
    "category": ["salad"]
  },
  {
    "name": "Vermicelli with Puttanesca Sauce",
    "id": "vermicelli-puttanesca",
    "img": "",
    "alt": "",
    "ingredients": [
      "2 lb. ripe tomatoes",
      "4 cloves garlic, finely chopped",
      "1/2 tsp crush red pepper",
      "1/4 cup extra virgin olive oil",
      "2/3 cup Kalamata  or good brine cured olives, rinsed, pitted and chopped",
      "4 to 5 whole anchovies, chopped",
      "2 tsps finely chopped fresh oregano",
      "2 Tbsps coarsely chopped fresh basil",
      "2 to 3 Tbsps capers, drained",
      "16 oz vermicelli or thin spaghetti or any thin pasta"
    ],
    "directions": [
      "Peel, seed and chop the tomatoes, reserving any liquid for later use in thinning the sauce.",
      "In a large. skillet, saute the garlic, tomatoes and crush red pepper in olive oil over medium heat.",
      "Add remaining ingredients, lower heat and simmer for 10 minute.",
      "If the sauce is too thick, thin with the reserved tomato juice or water.",
      "Cook the pasta in boiling,salted water until cooked al dente.",
      "Drain pasta and toss with a few teaspoons of olive oil.",
      "Put pasta on plates and top with a generous amount of sauce."
    ],
    "description": "",
    "category": ["pasta"]
  },
  {
    "name": "Zuppa di Cozze/Mussels in Spicy Sauce",
    "id": "zuppa-cozze",
    "img": "mussels-spicy-sauce.jpg",
    "alt": "mussels in spicy sauce",
    "ingredients": [
      "4 lbs mussels",
      "4 garlic, very finely chopped, plus 1 whole garlic clove",
      "2 Tbsp chopped fresh flat leaf parsley",
      "1  pinch of crushed red pepper",
      "1/3 cup olive oil",
      "1 cup white wine (dry)",
      "3 lbs ripe tomatoes, peeled, seeded, and chopped or two 28 oz can Italian peeled tomatoes, drain and chopped.",
      "8 slices Italian bread, toasted"
    ],
    "directions": [
      "Places the mussel in cold water to cover for 30 minutes.",
      "Drain and scrub them with a stiff brush.",
      "Scrape off any barnacles or seaweed.",
      "Discard any mussels with cracked shells or that do not shut tightly when tapped.",
      "Remove the bear by pulling toward the narrow end of the shells.",
      "In a large saucepan, cook the chopped garlic, parsley and peperoncino in the oil over low heat until the garlic is golden, about 1 minute.",
      "Stir in the wine and bring to simmer.",
      "Add the tomatoes and salt.",
      "Cook over medium heat, stirring occasionally, until the sauce is slightly thickened, about 20 minutes.",
      "Gently stir in mussels.",
      "Cover the pot. Cook until the mussels open 5 to 10 minutes. Discard any that refuse to open.",
      "Rub the toast with the garlic clove.",
      "Serve the mussels."
    ],
    "description": "",
    "category": ["seafood", "soup"]
  },
  {
    "name": "Zuppa di Baccala",
    "id": "zuppa-baccala",
    "img": "zuppadibaccala.jpg",
    "alt": "zuppa di baccala",
    "ingredients": [
      "2 Tbsps olive oil",
      "2 medium onion, chopped",
      "1 glove garlic, minced",
      "1 stalk celery, chopped",
      "3 medium tomatoes, chopped",
      "1 carrot, sliced",
      "2 large potatoes, cubed",
      "1 tbsp chopped parsley",
      "1 bay leaf",
      "salt and pepper to taste",
      "1 1/2 pounds cod fish, cut in 2″ pieces."
    ],
    "directions": [
      "In a large saucepan add the olive oil.",
      "Saute the onions,garlic and celery until onions are transparent.",
      "Cook over high heat, stirring constantly.",
      "Add remaining ingredients.",
      "Cook over medium heat about 25 to 30 minutes or until fish is cooked."
    ],
    "description": "",
    "category": ["seafood", "soup"]
  },
  {
    "name": "Easter Bread / Pigna",
    "id": "easter-bread",
    "img": "easter-bread.jpg",
    "alt": "easter bread",
    "ingredients": [
      "8 eggs",
      "1 cup olive oil",
      "2 cups sugar",
      "1 Tsp salt",
      "3- 3/4 oz yeast",
      "zest of 2 lemons",
      "4 tsps of vanilla",
      "flour as you need"
    ],
    "directions": [
      "After you mix all the ingredients let the dough rise well",
      "Make  the desired shape and let rice again",
      "Before you put the pigna in the owen take 2 eggs and whisk and brush them over the bread",
      "Oven on 350f"
    ],
    "description": "",
    "category": ["dessert"]
  },
  {
    "name": "Wine Cookies / Scruccietto",
    "id": "wine-cookies",
    "img": "wine-cookies.jpg",
    "alt": "wine cookies",
    "ingredients": [
      "1 cup sugar",
      "1 cup white wine",
      "1 cup olive olio",
      "1 teaspoon of anise seed",
      "Flour"
    ],
    "directions": [
      "On a board put flour",
      "Open the middle,make a hole and put all the ingredients in",
      "Incorporate the flour with all the ingredients and add more flour as you need",
      "Make the dough a little hard,let rest for 5 minutes",
      "Role the dough in a long strand like you would do gnocchi",
      "Break off sections,roll in a circle and dredge one side in sugar",
      "Turn the Oven at 375f",
      "And cook for 25 to 30 minutes until golden brown"
    ],
    "description": "",
    "category": ["dessert"]
  },
  {
    "name": "Mezzi Rigatoni with Porcini sauce",
    "id": "rigatoni-porcini",
    "img": "rigatoni-porcini.jpg",
    "alt": "rigatoni with procini sauce",
    "ingredients": [
      "1 lb  Mezzi Rigatoni ( you can use different pasta if you like)",
      "1 1/2 cup   Dried Porcini",
      "2 1/2Tbsp Olive oil",
      "1 cup  sweet grape tomatoes",
      "1/2 teaspoon dry sweet basil",
      "1/2 clove garlic chopped",
      "salt and pepper  to taste"
    ],
    "directions": [
      "In a bowl add warm water and add the dry mushrooms, change the water as they get soft.",
      "Squeeze the mushroom before adding them to the frying pan.",
      "Bring a pot of salted water to boil for the pasta",
      "Meanwhile, in a preheated pan, add the olive oil with the garlic, then add the mushrooms and tomatoes",
      "Saute’ them over high heat for a few minutes, add the dry basil,until well browned.",
      "Cook the Mezzi Rigatoni in the pot of boiling water al dente",
      "Drain. Transfer the pasta to the pan with the mushrooms and tomato and toss for a few seconds"
    ],
    "description": "",
    "category": ["pasta"]
  },
  {
    "name": "Stuffed Tomatoes",
    "id": "stuffed-tomatoes",
    "img": "stuffed-tomatoes.jpg",
    "alt": "stuffed tomatoes",
    "ingredients": [
      "1 cup minute rice",
      "1/2 cup Italian bread crumbs",
      "1/2 cup groudbeef cooked and drained",
      "4 tablespoons olive oil",
      "1/2 teaspoon salt",
      "1/4 teaspoon ground pepper",
      "1/4 cup freshly chopped basil leaves"
    ],
    "directions": [
      "Preheat the Owen 350F",
      "Salt the insides of the tomatoes",
      "Mix together bread crumbs,rice,basil,pepper,and olive oil",
      "Stuff tomatoes with the filling",
      "Bake until tomatoes are cooked through and top are golden brown"
    ],
    "description": "",
    "category": ["antipasti"]
  },
  {
    "name": "Gelato alla Vaniglia / Vanilla Ice Cream",
    "id": "vanilla-icecream",
    "img": "vanilla-icecream.jpg",
    "alt": "vanilla ice cream",
    "ingredients": [
      "6 eggs",
      "2 cups whole milk",
      "2 cups heavy cream",
      "1 cup sugar",
      "1 tspn vanilla extract"
    ],
    "directions": [
      "Beat eggs yolks until foamy",
      "Combine milk, cream, and sugar in top of a double boiler",
      "heat until small bubbles form around sides of the pan",
      "Add small amount of cream mixture to eggs yolks",
      "then stir yolks into cream mixture in top of double boiler",
      "Cook over simmering water, stirring constantly, until mixture thickens enough to lightly coat a metal spoon",
      "Add vanilla. Strain, cool thoroughly",
      "Pour into two deep metal freezer trays, cover wit foil",
      "Freeze until firm but not hard",
      "Chill bowl and beater",
      "Beat with electric mixer on high speed until double in volume",
      "Return to tray, freeze until firm but not hard",
      "Break up, beat again, freeze until firm but not hard",
      "Repeat, freeze until firm for 2 hours"
    ],
    "description": "",
    "category": ["dessert"]
  },{
    "name": "Pasta all'arrabbiata",
    "id": "pasta-arrabbiata",
    "img": "pasta-arrabbiata.jpg",
    "alt": "pasta arrabbiata",
    "ingredients": [
      "1 lb chopped tomatoes",
      "2 garlic cloves, crushed",
      "2/3 cup dry white wine",
      "1 Tbsp tomato puree",
      "1 pinch crushed red hot pepper",
      "11 oz penne or rigatoni",
      "1 tbsp fresh chopped parsley",
      "salt and pepper to taste",
      "Pecorino cheese to serve"
    ],
    "directions": [
      "Put the tomatoes, garlic, wine, tomato puree’ and hot pepper in a saucepan and bring to the boil",
      "Cover and simmer gently",
      "Add parsley",
      "Taste for seasoning",
      "If you prefer a hotter taste, add more crush hot pepper",
      "Drain the pasta and tip into a large bowl",
      "Pour the sauce over the pasta and toss to mix",
      "Serve at once, sprinkled with grated Pecorino and the remaining parsley"
    ],
    "description": "",
    "category": ["pasta"]
  }
]
